# CutLineWeight Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
OverrideGraphicSettings..::..CutLineWeight Property
OverrideGraphicSettings Class See Also
---
Cut surface line weight.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public int CutLineWeight { get; }
```

Visual Basic
---
```text
Public ReadOnly Property CutLineWeight As Integer
	Get
```

Visual C++
---
```text
public:
property int CutLineWeight {
	int get ();
}
```

# See Also
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace